ec2-galera/percona-standalone/2min_run_no_2.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 32

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 31 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            467852
        write:                           167090
        other:                           66836
        total:                           701778
    transactions:                        33418  (278.28 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 634942 (5287.40 per sec.)
    other operations:                    66836  (556.57 per sec.)

Test execution summary:
    total time:                          120.0860s
    total number of events:              33418
    total time taken by event execution: 3841.8612
    per-request statistics:
         min:                                 30.55ms
         avg:                                114.96ms
         max:                                516.36ms
         approx.  95 percentile:             196.12ms

Threads fairness:
    events (avg/stddev):           1044.3125/10.98
    execution time (avg/stddev):   120.0582/0.01