ec2-galera/percona-standalone/2min_run_no_4.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 32

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 31 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            486514
        write:                           173755
        other:                           69502
        total:                           729771
    transactions:                        34751  (289.45 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 660269 (5499.47 per sec.)
    other operations:                    69502  (578.89 per sec.)

Test execution summary:
    total time:                          120.0604s
    total number of events:              34751
    total time taken by event execution: 3841.0655
    per-request statistics:
         min:                                 30.07ms
         avg:                                110.53ms
         max:                                447.77ms
         approx.  95 percentile:             190.17ms

Threads fairness:
    events (avg/stddev):           1085.9688/12.24
    execution time (avg/stddev):   120.0333/0.01